<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL Exam
© ExploreAI Academy

## Instructions to students

This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good luck!_**

## Honour code

I, YOUR NAME YOUR SURNAME, confirm – by submitting this document – that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb database

In this supplementary exam, you will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment.  You can do this by loading the magic command `%load_ext sql`.

In [2]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file from Athena and have stored it in a known location.

In [4]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.


%sql sqlite:///TMDB.db

Connecting to 'sqlite:///TMDB.db'

If the above line didn't throw out any errors, then you should be good to go. Good luck with the exam!

## Questions on SQL

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided. Your solution should match one of the multiple-choice questions on Athena.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

(Hint: The winner is indicated as '1.0'.)

**Options:** 

  - Micheal Fassbender
  - Natalie Portman
  - Leonardo DiCaprio
  - Eddie Redmayne

In [11]:
%%sql
select
    winner,
    year,
    award,
    name
from
    oscars
where winner like '%1.0%' and year = 2015;

Running query in 'sqlite:///TMDB.db'

+--------+------+------------------------------+-----------------------------------------------+
| winner | year |            award             |                      name                     |
+--------+------+------------------------------+-----------------------------------------------+
|  1.0   | 2015 |   Actor in a Leading Role    |               Leonardo DiCaprio               |
|  1.0   | 2015 |  Actor in a Supporting Role  |                  Mark Rylance                 |
|  1.0   | 2015 |  Actress in a Leading Role   |                  Brie Larson                  |
|  1.0   | 2015 | Actress in a Supporting Role |                Alicia Vikander                |
|  1.0   | 2015 |    Animated Feature Film     |                   Inside Out                  |
|  1.0   | 2015 |        Costume Design        |               Mad Max: Fury Road              |
|  1.0   | 2015 |          Directing           |                  The Revenant                 |
|  1.0   | 2015 |    Documentary (Feature)     |                      Amy                      |
|  1.0   | 2015 | Documentary (Short Subject)  | A Girl in the River: The Price of Forgiveness |
|  1.0   | 2015 |         Film Editing         |               Mad Max: Fury Road              |
+--------+------+------------------------------+-----------------------------------------------+
Truncated to displaylimit of 10.

### Question 2

What query will produce the ten oldest movies in the database?

**Options:**

 - SELECT TOP(10) * FROM movies WHERE release_date ORDER BY release_date ASC

 - SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10

 - SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

 -  SELECT * FROM movies WHERE release_date IS NULL ORDER BY release_date DESC LIMIT 10

In [7]:
%%sql
SELECT 
    title,
    release_date,
    movie_id
FROM movies
WHERE release_date IS NOT NULL
ORDER BY release_date ASC
LIMIT 10;

Running query in 'sqlite:///TMDB.db'

+-----------------------+----------------------------+----------+
|         title         |        release_date        | movie_id |
+-----------------------+----------------------------+----------+
|      Intolerance      | 1916-09-04 00:00:00.000000 |   3059   |
|     The Big Parade    | 1925-11-05 00:00:00.000000 |   3060   |
|       Metropolis      | 1927-01-10 00:00:00.000000 |    19    |
|     Pandora's Box     | 1929-01-30 00:00:00.000000 |   905    |
|  The Broadway Melody  | 1929-02-08 00:00:00.000000 |  65203   |
|     Hell's Angels     | 1930-11-15 00:00:00.000000 |  22301   |
|   A Farewell to Arms  | 1932-12-08 00:00:00.000000 |  22649   |
|      42nd Street      | 1933-02-02 00:00:00.000000 |   3062   |
|   She Done Him Wrong  | 1933-02-09 00:00:00.000000 |  43595   |
| It Happened One Night | 1934-02-22 00:00:00.000000 |   3078   |
+-----------------------+----------------------------+----------+
Truncated to displaylimit of 10.

### Question 3

How many unique awards are there in the Oscars table?

**Options:**
 - 141
 - 53 
 - 80
 - 114

In [12]:
%%sql
select
    count(distinct award)
from
    oscars

Running query in 'sqlite:///TMDB.db'

+-----------------------+
| count(distinct award) |
+-----------------------+
|          114          |
+-----------------------+

### Question 4

How many movies are there that contain the word “Spider” within their title?

**Options:**
 - 0
 - 5
 - 1
 - 9

In [14]:
%%sql
select
    count(title)
from
    movies
where
    title like '%Spider%'

Running query in 'sqlite:///TMDB.db'

+--------------+
| count(title) |
+--------------+
|      9       |
+--------------+

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?


**Options:**
 - 48
 - 38
 - 14
 - 1

In [86]:
%%sql
select
    count( distinct m.movie_id)
from
    movies as m
JOIN
    genremap
    ON m.movie_id = genremap.movie_id
JOIN
    genres g
    ON genremap.genre_id = g.genre_id
join
    keywordmap as km
    on m.movie_id = km.movie_id
join
    keywords as k
    on k.keyword_id = km.keyword_id
where
     
    keyword_name like '%love%' and genre_name like '%Thriller%';

Running query in 'sqlite:///TMDB.db'

+-----------------------------+
| count( distinct m.movie_id) |
+-----------------------------+
|              48             |
+-----------------------------+

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

 
**Options:**

 - 29
 - 23
 - 28
 - 35

In [12]:
%%sql
select
    count(distinct title)
from
    movies
where
    release_date between '2006-08-01' and '2009-10-01'
    and popularity > 40
    and budget < 50000000;

Running query in 'sqlite:///TMDB.db'

+-----------------------+
| count(distinct title) |
+-----------------------+
|           29          |
+-----------------------+

### Question 7

How many unique characters has "Vin Diesel" played so far in the database?

**Options:**
 - 24
 - 19
 - 18
 - 16

In [5]:
%%sql
select
    count(distinct c.characters)
from
    movies as m

left join
    casts as c
    on m.movie_id = c.movie_id
join
    actors as a
    on a.actor_id = c.actor_id
where
    a.actor_name like '%vin Diesel%';

Running query in 'sqlite:///TMDB.db'

+------------------------------+
| count(distinct c.characters) |
+------------------------------+
|              16              |
+------------------------------+

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?


**Options:**
 - Action, Romance
 - Drama, Comedy
 - Crime, Thriller
 - Drama, Romance

In [45]:
%%sql
select
    g.genre_name
from
    movies as m
join genremap as gm
    on m.movie_id = gm.movie_id
join
    genres as g
    on g.genre_id = gm.genre_id
where
    m.title like '%The Royal Tenenbaums';

Running query in 'sqlite:///TMDB.db'

+------------+
| genre_name |
+------------+
|   Drama    |
|   Comedy   |
+------------+

### Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?


**Options:**

 - MCL Films S.A., Turner Pictures, and George Stevens Productions
 - The Donners' Company, Bulletproof Cupid, and Kinberg Genre
 - Bulletproof Cupid, The Donners' Company, and MCL Films S.A
 - B.Sting Entertainment, Illumination Pictures, and Aztec Musique

In [51]:
%%sql
select
    pc.production_company_name as name,
    avg(popularity) as average
from
    movies as m
join
    productioncompanymap as pcm
    on m.movie_id = pcm.movie_id
join
    productioncompanies as pc
    on pcm.production_company_id = pc.production_company_id
group by pc.production_company_name
order by average desc;

Running query in 'sqlite:///TMDB.db'

+----------------------------------+--------------------+
|               name               |      average       |
+----------------------------------+--------------------+
|       The Donners' Company       |     514.569956     |
|        Bulletproof Cupid         |     481.098624     |
|          Kinberg Genre           | 326.92099900000005 |
|    Illumination Entertainment    |    234.9200424     |
| Vita-Ray Dutch Productions (III) |     198.372395     |
|      Deluxe Digital Studios      |     198.372395     |
|             Syncopy              |    192.4171875     |
|      Lynda Obst Productions      |    192.22636225    |
|      Cruel & Unusual Films       |     155.790452     |
|           Linson Films           |     146.757391     |
+----------------------------------+--------------------+
Truncated to displaylimit of 10.

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?


**Options:**

 - 0
 - 355
 - 7335
 - 1949

In [53]:
%%sql
select
    count(actor_name),
    gender
from
    actors
where
    gender = 1 and actor_name like 'N%';

Running query in 'sqlite:///TMDB.db'

+-------------------+--------+
| count(actor_name) | gender |
+-------------------+--------+
|        355        |   1    |
+-------------------+--------+

### Question 11

Which genre has, on average, the lowest movie popularity score? 


**Options:**

 - Science Fiction
 - Animation
 - Documentary
 - Foreign

In [55]:
%%sql
select
     g.genre_name as name,
    avg(popularity) as average
from
    movies as m
join genremap as gm
    on m.movie_id = gm.movie_id
join
    genres as g
    on g.genre_id = gm.genre_id
group by genre_name
order by average asc;

Running query in 'sqlite:///TMDB.db'

+-------------+--------------------+
|     name    |      average       |
+-------------+--------------------+
|   Foreign   | 0.686786794117647  |
| Documentary | 3.945723809090908  |
|   TV Movie  | 6.389414749999999  |
|    Music    | 13.101512475675676 |
|   Romance   | 15.962426457494416 |
|   History   | 17.444838720812175 |
|    Drama    | 17.764853371789304 |
|    Comedy   | 18.221000988966285 |
|   Western   | 18.23627854878048  |
|    Horror   | 18.295915104046244 |
+-------------+--------------------+
Truncated to displaylimit of 10.

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

**Options:**

- Special Achievement Award
- Actor in a Supporting Role
- Actress in a Supporting Role
- Best Picture

In [68]:
%%sql
select
    o.award,
    count(award) as number_of_nominies
from
    oscars as o
join
    movies as m
    on o.film = m.title
join
    casts as c
    on c.movie_id = m.movie_id
join
    actors as a
    on a.actor_id = c.actor_id
group by o.award
order by number_of_nominies desc;

Running query in 'sqlite:///TMDB.db'

+------------------------------+--------------------+
|            award             | number_of_nominies |
+------------------------------+--------------------+
|  Actor in a Supporting Role  |        6726        |
|   Actor in a Leading Role    |        4802        |
| Actress in a Supporting Role |        4790        |
|  Actress in a Leading Role   |        2932        |
|            Actor             |        1880        |
|           Actress            |        540         |
|        Special Award         |        199         |
|  Special Achievement Award   |        119         |
|    Foreign Language Film     |         88         |
|        Honorary Award        |         36         |
+------------------------------+--------------------+
Truncated to displaylimit of 10.

### Question 13

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year).  Which of the following options would be the appropriate code to update this column to have the format of the year be consistent throughout the entire table (second indicated year only shown)?


**Options:**

- `UPDATE Oscars SET year = RIGHT(year, -4)`
- `UPDATE Oscars SET year = SELECT substr(year, -4)`
- `UPDATE Oscars SET year = substr(year, -4)`
- `UPDATE Oscars year =  substr(year, 4)`

In [71]:
%%sql
UPDATE Oscars SET year = substr(year, -4);

Running query in 'sqlite:///TMDB.db'

9964 rows affected.

++
||
++
++

### Question 14

DStv will be having a special week dedicated to the actor Alan Rickman. Which of the following queries would create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in?



**Options:**

- SELECT title, release_date, tagline, overview 
FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id 
WHERE Actors.actor_name = 'Alan Rickman'
AS VIEW Alan_Rickman_Movies

- CREATE VIEW Alan_Rickman_Movies AS  
SELECT title, release_date, tagline, overview FROM Movies  
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman' 


- CREATE NEW VIEW  Name  = Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

- VIEW Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

In [72]:
%%sql
CREATE VIEW Alan_Rickman_Movies AS
SELECT title, release_date, tagline, overview
FROM Movies
LEFT JOIN Casts
ON Casts.movie_id = Movies.movie_id
Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman'

Running query in 'sqlite:///TMDB.db'

RuntimeError: (sqlite3.OperationalError) view Alan_Rickman_Movies already exists
[SQL: CREATE VIEW Alan_Rickman_Movies AS
SELECT title, release_date, tagline, overview
FROM Movies
LEFT JOIN Casts
ON Casts.movie_id = Movies.movie_id
Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman']
(Background on this error at: https://sqlalche.me/e/20/e3q8)
If you need help solving this issue, send us a message: https://ploomber.io/community

### Question 15

Which of the statements about database normalisation are true?

**Statements:**
 
i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.

iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.

iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

**Options:**

 - (i) and (ii)
 - (i) and (iii)
 - (ii) and (iv)
 - (iii) and (iv)

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>